-- Таблицы заполняются вручную

--[[__________________________________________________________________________________________________________

Таблица 1. Данные Клиента(Пользователя), инициировавшего событие
    _______________________________________________________
   |   NodeName  |    AppName   |  NodeIP   |   ARMname   |
    ------------------------------------------------------
   |      1      |      2       |    3      |      4      |
    ------------------------------------------------------
	1 - Имя Узла
	2 - Имена приложений входящих в состав Узла
	3 - Сетевой адрес Узла 
	4 - Сетевое имя устройсва (Узла) на катором находтся												]]

Client = {
	{NodeName	= 'test_PLC', AppName	= {'IBE', 'EV_LOG', 'AServ', 'AServ', 'SQLIB'}, NodeIP	='127.0.0.1', ARMname	= 'TestARM'},
	--{NodeName	= '', AppName = {'', '', '', '', ''}, NodeIP ='', ARMname = ''},-- шаблон строк в таблице
}

--[[__________________________________________________________________________________________________________

Таблица 2. Данные по серверам АСУ ТП
     ______________________
    | IPAddress | HostName |
     ----------------------
    |     1     |    2     |
     ----------------------
	1 - Сетевой ip адрес сервера SCADA
	2 - Сетевое имя сервера SCADA 																		]]


Server = {
	{IPAddress = "10.9.119.77", HostName = "Server_A2_Osn"},
	{IPAddress = "10.9.119.79", HostName = "Server_A3_Res"},
	--{IPAddress = '', HostName = ''},-- шаблон строк в таблице
}
--

--[[__________________________________________________________________________________________________________

Таблица 3. Данные на объект события
     _______________________________________________
    | NameRu | PrefAb | Name | IPAddress | HostName |
     -----------------------------------------------
    |    1   |   2    |   3  |     4     |    5     |
     -----------------------------------------------
	1 - Имя абонента на русском языке
	2 - Префикс абонента для алгоритмических переменых
	3 - Имя типа идентификатора на которе нацеленно событие 
	4 - Сетевой ip адес устройства (Узла) на которое нацеленно событие
	5 - Сетевое имя устройства (Узла) на которое нацеленно событие										]]

Target = {
	{NameRU = "ГПА1", PrefAb = 'CGPA1_', Name = "GPA", IPAddress = "192.168.1.11", HostName = "GPA1_PLC"},
	{NameRU = "ГПА2", PrefAb = 'CGPA2_', Name = "GPA", IPAddress = "192.168.1.12", HostName = "GPA2_PLC"},
	{NameRU = "ГПА3", PrefAb = 'CGPA3_', Name = "GPA", IPAddress = "192.168.1.13", HostName = "GPA3_PLC"},
	{NameRU = "ГПА4", PrefAb = 'CGPA4_', Name = "GPA", IPAddress = "192.168.1.14", HostName = "GPA4_PLC"},
	{NameRU = "ГПА5", PrefAb = 'CGPA5_', Name = "GPA", IPAddress = "192.168.1.15", HostName = "GPA5_PLC"},
	{NameRU = "ГПА6", PrefAb = 'CGPA6_', Name = "GPA", IPAddress = "192.168.1.16", HostName = "GPA6_PLC"},
	{NameRU = "ГПА7", PrefAb = 'CGPA7_', Name = "GPA", IPAddress = "192.168.1.17", HostName = "GPA7_PLC"},
	{NameRU = "ГПА8", PrefAb = 'CGPA8_', Name = "GPA", IPAddress = "192.168.1.18", HostName = "GPA8_PLC"},
	{NameRU = "Скада", PrefAb = 'SCADA', Name = "SCADA", IPAddress = "127.0.0.1", HostName = "HMI"},
	{NameRU = "Система", PrefAb = 'Система', Name = "Система", IPAddress = "127.0.0.1", HostName = "Система"},
	--{NameRU = "", PrefAb = '', Name = "", IPAddress = "", HostName = ""},	-- шаблон строк в таблице
}